---
title: FilterStringRule
classe: Autodesk.Revit.DB.FilterStringRule
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.FilterValueRule
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FilterStringRule

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String RuleString { get; set; }` | `filterStringRule.RuleString` | String |
| `FilterStringRuleEvaluator GetEvaluator()` | `filterStringRule.GetEvaluator()` | FilterStringRuleEvaluator |
| `Void SetEvaluator(FilterStringRuleEvaluator)` | `filterStringRule.SetEvaluator(evaluator)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```